glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <time.h>


#include "stm32f10x.h"
#include "sdio_sd.h"
#include "ff.h"


#include <FreeRTOS.h>
#include "task.h"
#include "semphr.h"
#include "queue.h"


#include "wdlist.h"
#include "ksystem.h"
#include "global.h"

#include "tempctrlpid_thr.h"

//-----------------------------------------------------------------------------

// PID wspó³czynniki
const k_long Kp_def= 14000;			// 16,000 ok
const k_long Ki_def= 300;			// 0,010			400 -ok
const k_long Kd_def= 12000;			// 10,000

// nastawy min, max

#define PID_REG_MIN				(k_long)0		//  0,000
#define PID_REG_MAX				(k_long)10000	// 10,000

#define PWM_WARM_DOWN_FACTOR		200			// [0,1%]
#define PWM_WARM_CONST_FACTOR		500			// [0,1%]

#define PWM_PERIOD						20 				// sec
#define PWM_TIMER_FREQ					1200			// Hz
#define PWM_DUTY_RATIO_MAX_DEFAULT		1000
#define PWM_DUTY_RATIO_CUTOFF			350

#define PWM_MAX_THROTTLE_TIMEOUT		600				// sec

#define MAX_TEMPERATURE					24000



#define LOGFILE_BUFFER_LENGTH			256

//#define PWM_CYCLE_TICKS			(uint16_t)(PWM_PERIOD * PWM_TIMER_FREQ)
//#define	PWM_PID_RATIO			(float)((float)PWM_CYCLE_TICKS / (float)PID_REG_MAX)


// 45%/20 !!!


//-----------------------------------------------------------------------------

extern main_settings_s main_settings;

extern xSemaphoreHandle thermometer_sem;

extern wdlist_s heater_list;
extern xQueueHandle temp_pid_queue;

extern heater_ctrl_handler_s heater_ctrl_chnlst[HEATER_NUMBER];
extern unsigned char *cmd_inter_strtok_del;





int pwm_duty_ratio_max;
k_long Kp, Ki, Kd;

FATFS fs;
FIL fsrc;
bool logfile_open_f;
struct tm currtime_tm;



//-----------------------------------------------------------------------------

k_long temp_pid_process(PID_data_s *PID_data, k_long uchyb);
k_long pwm_channel_init(heater_ctrl_handler_s *heater_ctrl_handler);
k_long open_window_status(heater_s *heater);

void tempctrl_write2logfile();



//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
/*
void led_switch()
	{
	static char ledstate= 0;

	if (ledstate)
		{
		ledstate= 0;
		GPIO_ResetBits(GPIOB , GPIO_Pin_1);
		}
	else
		{
		ledstate= 1;
		GPIO_SetBits(GPIOB , GPIO_Pin_1);
		}

	}
*/


void prvTempCtrlPIDTask(void *pvParameters)
	{
	k_uchar queue_dta;

	wdlist_entry_s *heater_entry= NULL;
	heater_s *heater;
	thermometer_s *thermometer;
	heater_ctrl_handler_s *heater_ctrl_handler;
	k_long heater_temp;
	k_long temp_uchyb;
	k_long ctrl_param;

	uint16_t duty_ratio;

	portTickType ticks_curr;
	portTickType ticks_prev;
	k_ulong time_elapsed_sec;

	time_t currtime;
	char conbuffer[32];



	pwm_duty_ratio_max= PWM_DUTY_RATIO_MAX_DEFAULT;

	Kp= Kp_def;
	Ki= Ki_def;
	Kd= Kd_def;

	logfile_open_f= false;




	heater_ctrl_chnlst[0].peripheral_addr= (uint32_t)GPIOB;
	heater_ctrl_chnlst[0].ctrl_pin= GPIO_Pin_6;				// TIM4_CH1
	heater_ctrl_chnlst[0].period= PWM_PERIOD;
	heater_ctrl_chnlst[0].pwm_chn= 1;
	pwm_channel_init(&heater_ctrl_chnlst[0]);

	heater_ctrl_chnlst[1].peripheral_addr= (uint32_t)GPIOB;
	heater_ctrl_chnlst[1].ctrl_pin= GPIO_Pin_7;				// TIM4_CH2
	heater_ctrl_chnlst[1].period= PWM_PERIOD;
	heater_ctrl_chnlst[1].pwm_chn= 2;
	pwm_channel_init(&heater_ctrl_chnlst[1]);


/*
	heater_ctrl_chnlst[2].peripheral_addr= (uint32_t)GPIOB;
	heater_ctrl_chnlst[2].ctrl_pin= GPIO_Pin_8;				// TIM4_CH3
	heater_ctrl_chnlst[2].period= PWM_PERIOD;
	heater_ctrl_chnlst[2].pwm_chn= 3;
	pwm_channel_init(&heater_ctrl_chnlst[2]);

	heater_ctrl_chnlst[3].peripheral_addr= (uint32_t)GPIOB;
	heater_ctrl_chnlst[3].ctrl_pin= GPIO_Pin_9;				// TIM4_CH4
	heater_ctrl_chnlst[3].period= PWM_PERIOD;
	heater_ctrl_chnlst[3].pwm_chn= 4;
	pwm_channel_init(&heater_ctrl_chnlst[3]);
*/





	msleep(5000);







	heater_entry= heater_list.first_entry;
	while (heater_entry)
		{
		heater= (heater_s *)heater_entry->data;

		heater->PID_data.uchyb_prev= 0x80000000; // magic value
		heater->PID_data.I_prev= 0;

		heater_entry= heater_entry->next;
		}


	ticks_prev= xTaskGetTickCount();

	queue_dta= 0x01; // init
	xQueueSend(temp_pid_queue, &queue_dta, (portTickType)0);



	while (1)
		{


		xQueueReceive(temp_pid_queue, &queue_dta, portMAX_DELAY); // czekam na zakoñczenie cyklu odczytu temperatur


		ticks_curr= xTaskGetTickCount();
		time_elapsed_sec= (ticks_curr >= ticks_prev) ? (ticks_curr - ticks_prev) : (0xFFFFFFFF - ticks_prev + 1 + ticks_curr);
		time_elapsed_sec/= configTICK_RATE_HZ;
		ticks_prev= ticks_curr;

		currtime= time(0);
		localtime_r(&currtime, &currtime_tm);
		strftime(conbuffer, 32, "%Y-%m-%d %H:%M:%S", &currtime_tm);
		printf("<TIME> %s\n", conbuffer);

		printf("MODE: %d\n", main_settings.global_mode);



		heater_entry= heater_list.first_entry;
		while (heater_entry)
			{
			heater= (heater_s *)heater_entry->data;

			thermometer= heater->thermometer;
			heater_ctrl_handler= thermometer ? heater->heater_ctrl_handler : NULL;




			switch (main_settings.global_mode)
				{

//--------------------------------------------------------------

				case GLOBAL_MODE_IDLE:
					{



					// wy³¹czenie timera
					heater->max_throttle_timeout_active= false;


					break;
					} // GLOBAL_MODE_IDLE

//--------------------------------------------------------------

				case GLOBAL_MODE_HEATING:
					{


					if (thermometer)
						{

						xSemaphoreTake(thermometer_sem, 0);


						if ((queue_dta == 0x01) || !thermometer->temp_vaild)
							{
							// zerowanie, wy³¹cz grzanie

							xSemaphoreGive(thermometer_sem);


							// wy³¹czenie timera
							heater->max_throttle_timeout_active= false;
							heater->max_throttle_timeout= 0;


							// wy³aczam grzanie
							duty_ratio= 0;

