glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
					printf("<HTR> dev[%02d]: window opened\n", heater->indx);
					}
				}
			else
				{
				// timeout
				// temperatura nie spadla przez zadany okres
				heater->owp_begin_time= 0;
				heater->owp_state= 0x00;
				}

			break;
			}

		case 0x01:
			{
			// detekcja zamkniêcia okna

			if (heater->temp_current < heater->temp_prev)
				heater->owp_begin_time= now;
			else
			if ((now - heater->owp_begin_time) >= 120)
				{
				// wykryto zamkniête okno
				// temperatura nie spadla przez zadany okres
				heater->owp_begin_time= 0;
				heater->owp_state= 0x00;

				printf("<HTR> dev[%02d]: window closed\n", heater->indx);
				}

			break;
			}

		default:
			{
			heater->owp_begin_time= 0;
			heater->owp_state= 0x00;
			break;
			}

		} // switch (heater->owp_state)


	printf("opw: %02X tb %d, td %d, temp_now %5d, temp_prev %5d, temp_begin %5d\n", heater->owp_state, heater->owp_begin_time, now - heater->owp_begin_time, heater->temp_current, heater->temp_prev, heater->owp_begin_temp);

	return heater->owp_state;
	}

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

void tempctrl_write2logfile()
	{
	FRESULT res;
	UINT br;
	wdlist_entry_s *heater_entry= NULL;
	heater_s *heater;

	static u8 buffer_tmp[64];
	static u8 logfile_buffer[LOGFILE_BUFFER_LENGTH];


	if (!logfile_open_f)
		{

		if (SD_Detect() == SD_PRESENT)
			{
			res= f_mount(0, &fs);

			sprintf(logfile_buffer, "0:/");
			strftime(buffer_tmp, 16, "%Y%m%d", &currtime_tm);
			strcat(logfile_buffer, buffer_tmp);
			strcat(logfile_buffer, ".csv");
			res= f_open(&fsrc, logfile_buffer, FA_OPEN_ALWAYS | FA_WRITE);
			printf("f_open: %s\n", (res == FR_OK) ? "success" : "fail");

			if (res == FR_OK)
				{
				res= f_lseek(&fsrc, f_size(&fsrc));
				printf("f_lseek: %s\n", (res == FR_OK) ? "success" : "fail");

				logfile_open_f= true;
				}
			}

		} // if (!logfile_open_f)


	if (!logfile_open_f)
		return ;

	if (SD_Detect() != SD_PRESENT)
		{
		printf("SD CARD: not present\n");

		logfile_open_f= false;
		f_close(&fsrc);

		f_mount(0, NULL); // umount

		return ;
		}

	strftime(logfile_buffer, LOGFILE_BUFFER_LENGTH, "%H:%M:%S", &currtime_tm);

	sprintf(buffer_tmp, ";%d", main_settings.global_mode);
	strcat(logfile_buffer, buffer_tmp);

	heater_entry= heater_list.first_entry;
	while (heater_entry)
		{
		heater= (heater_s *)heater_entry->data;

		sprintf(buffer_tmp, ";%d;%d;%d;%d;%2.3f;%2.3f;%2.3f;%d;%d;%d;%d",
			heater->state,
			heater->PID_data.P/1000,
			heater->PID_data.I/1000,
			heater->PID_data.D/1000,
			(float)heater->temp_zadana/1000,
			(float)heater->temp_offset/1000,
			(float)heater->temp_current/1000,
			heater->pid_state,
			heater->heater_ctrl_handler->duty_ratio,
			heater->max_throttle_timeout_active,
			heater->max_throttle_timeout
			);

		strcat(logfile_buffer, buffer_tmp);

		heater_entry= heater_entry->next;
		}

//	printf("%s\n", logfile_buffer);
	strcat(logfile_buffer, "\r\n");

	res= f_write(&fsrc, logfile_buffer, strlen(logfile_buffer), &br);
	f_sync(&fsrc);

	}

//-----------------------------------------------------------------------------


/*

heater <number> pwm <value>

*/

void cmdline_heater_param_set(unsigned char *param)
	{
	unsigned char *tokptr;
	k_uchar indx= 0;

	heater_s *heater= NULL;
	k_uchar cmd= 0xFF;
	k_uchar nparam= 0;

	const k_uchar max_nparam= 3;
	k_ulong paramsval[max_nparam];

	while (param)
		{

		switch (indx)
			{

			case 0:	// indeks grzejnika
				{
				wdlist_entry_s *entry;
				heater_s *heater_tmp;
				k_uchar hindx;

				hindx= atoi(param);

				entry= heater_list.first_entry;
				while (entry)
					{
					heater_tmp= (heater_s *)entry->data;

					if (heater_tmp->indx == hindx)
						{
						heater= heater_tmp;
						break;
						}

					entry= entry->next;
					}

				break;
				}


			case 1:
				{

				if (!strcmp(param, "pwm"))
					cmd= 0x01;
				else
				if (!strcmp(param, "temp"))
					cmd= 0x02;

				break;
				}

			default:
				{

				if (nparam < max_nparam)
					{
					paramsval[nparam]= atoi(param);
					nparam++;
					}

				break;
				}

			} // switch (indx)

		indx++;
		param= strtok(NULL, cmd_inter_strtok_del);
		}


	if (heater)
		{

		switch (cmd)
			{

			case 0x01:	// pwm
				{
				if (nparam == 1)
					{
					printf("<HTR> dev[%02d]: PWM set to %d\n", heater->indx, paramsval[0]);
					pwm_channel_set(heater->heater_ctrl_handler, paramsval[0]);
					}
				break;
				}

			case 0x02:	// temperatura zadana
				{
				if (nparam == 1)
					{
					printf("<HTR> dev[%02d]: temp set to %d\n", heater->indx, paramsval[0]);

					heater->temp_zadana= paramsval[0];

					heater->PID_data.uchyb_prev= 0x80000000; // magic value
					heater->PID_data.I_prev= 0;

					}
				break;
				}

			} // switch (cmd)


		} // if (heater)

	}

//-----------------------------------------------------------------------------

void cmdline_heater_pwm_duty_ratio_max_set(unsigned char *param)
	{
	k_ulong paramsval;

	if (!param)
		return;

	paramsval= atoi(param);

	if (paramsval < 0)
		paramsval= 0;
	else
	if (paramsval > 1000)
		paramsval= 1000;

	pwm_duty_ratio_max= paramsval;

	printf("<PWM> max duty ratio set to %d\n", pwm_duty_ratio_max);

	}

//-----------------------------------------------------------------------------

void cmdline_pid_set(unsigned char *param)
	{
	unsigned char *tokptr;
	k_uchar indx= 0;

	k_uchar cmd= 0xFF;
	k_uchar nparam= 0;

	const k_uchar max_nparam= 3;
	k_ulong paramsval[max_nparam];

	while (param)
		{

		switch (indx)
			{

			case 0:
				{

				if (!strcmp(param, "p"))
					cmd= 0x01;
				else
				if (!strcmp(param, "i"))
					cmd= 0x02;
				else
				if (!strcmp(param, "d"))
					cmd= 0x03;

				break;
				}

			default:
				{

				if (nparam < max_nparam)
					{
					paramsval[nparam]= atoi(param);
					nparam++;
					}

				break;
				}

			} // switch (indx)

		indx++;
		param= strtok(NULL, cmd_inter_strtok_del);
		}



	switch (cmd)
		{

		case 0x01:	// PID P
			{

			if (nparam == 1)
				{
				Kp= paramsval[0];
				printf("<PID> P set to: %d\n", Kp);
				}

			break;
			}

		case 0x02:	// PID I
			{

			if (nparam == 1)
				{
				Ki= paramsval[0];
				printf("<PID> I set to: %d\n", Ki);
				}

			break;
			}

		case 0x03:	// PID D
			{

			if (nparam == 1)
				{
				Kd= paramsval[0];
				printf("<PID> D set to: %d\n", Kd);
				}

			break;
			}

		} // switch (cmd)



	}


//-----------------------------------------------------------------------------

